// 1. Написать функцию, преобразующую число в объект.
// Передавая на вход число от 0 до 999, мы должны получить на выходе объект,
//     в котором в соответствующих свойствах описаны единицы, десятки и сотни.
//         Например, для числа 245 мы должны получить следующий объект:
// { ‘единицы’: 5, ‘десятки’: 4, ‘сотни’: 2 }.Если число превышает 999,
//     необходимо выдать соответствующее сообщение с помощью console.log и вернуть пустой объект.


function deliNumber(number) {
    if (number <= 999 && number >= 0) {
        let spam = {
            one: number % 10,
            ten: Math.floor(number / 10 % 10),
            hundred: Math.floor(number / 100 % 10)
        }
        //return spam // для красоты сделал ниже
        return `В введеном числе ${spam.one} единиц\n${spam.ten} деcятков\n${spam.hundred} сотен`
    }
    else {
        let spam = {
        }
        //return spam
        return 'Некорректные данные'
    }

};

let total = deliNumber(999);
console.log(total);

